Feature: Визуализиране на налични книги

  Background: отваряне на приложението
    Given отваряне на приложението

  Scenario: Отваряне на начален екран с налични книги
    Then Визуализира се списък с категории
    And Визуализира списък с наличните 10 книги

  Scenario: Отваряне на начален екран с книги с избор на категория
    When потребителя избере категория: "Трилър"
    Then Визуализира списък с наличните 3 книги
#
#  Scenario: Отваряне на начален екран с книги с търсене по име на книга
#    When потребителя въвежда име на книга "Институтът" в полето за търсене
#    And натиска бутона за търсене
#    Then Визуализира списък с наличните 1 книги
#
#  Scenario: Отваряне на начален екран с книги с търсене по име на автор
#    When потребителя въвежда име на автор "Стивън Кинг" в полето за търсене
#    And натиска бутона за търсене
#    Then Визуализира списък с наличните 2 книги
#
#  Scenario Outline: Отваряне на начален екран с книги с търсене по име на книга
#    When потребителя въвежда име на книгата <име> в полето за търсене
#    And натиска бутона за търсене
#    Then Визуализира списък с наличните <брои> книги
#    Examples:
#      | име                               | брои |
#      | "Институтът"                      | 2    |
#      | ""                                | 6    |
#      | "         "                       | 6    |
#      | "$#%$&^^(*&&*()*)(*)(<><df;;;;'>" | 0    |
